In [1]:
import pandas as pd
import numpy as np

from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()
engine = create_engine("postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development")
conpg = engine.connect()

In [3]:
sql = """
SELECT YEAR(date), COUNT(*)
FROM sells
GROUP BY YEAR(date)"""
df = pd.read_sql(sql, conpf)
df

   YEAR(date)  COUNT(*)
0        2017        68
1        2018       103
2        2019        42
3        2020        94
4        2021       254
5        2022       109
6        2023        45

In [4]:
sql = '''
SELECT * FROM sells LIMIT 1'''
sells = pd.read_sql(sql, conpf)
sells.dtypes

id               int64
buy_id           int64
date            object
price          float64
fee            float64
vat            float64
net            float64
days             int64
profit         float64
percent        float64
yearly         float64
sequence         int64
chart           object
dividend_id      int64
dtype: object

In [5]:
sql = '''
SELECT buy_id, S.date, YEAR(S.date) AS year, MONTH(S.date) AS month, S.price, qty, S.price*qty AS amt, 
S.net, profit, days, percent, yearly, dividend_id
FROM sells S 
JOIN buys B ON buy_id = B.id ORDER BY S.id DESC'''
sells = pd.read_sql(sql, conpf)
sells

,buy_id,date,year,month,price,qty,amt,net,profit,days,percent,yearly,dividend_id
0,1177,2023-08-31,2023,8,10.60,10000,106000.0,105765.22,532.66,471,0.50617,0.39225,0
1,1246,2023-08-31,2023,8,24.60,1200,29520.0,29454.61,1312.41,171,4.66349,9.95423,0
2,1252,2023-08-23,2023,8,20.60,1200,24720.0,24665.25,1093.15,126,4.63747,13.43394,0
3,1264,2023-08-17,2023,8,15.90,1400,22260.0,22210.69,2146.35,59,10.69734,66.17846,0
4,1278,2023-07-27,2023,7,15.10,100,1510.0,1506.65,73.48,38,5.12710,49.24714,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
710,324,2017-05-05,2017,5,79.25,3000,237750.0,237223.41,9470.07,16,4.15804,94.85529,0
711,306,2017-02-24,2017,2,15.40,10000,154000.0,153658.91,4328.89,10,2.89887,105.80876,0
712,307,2017-02-23,2017,2,72.25,4000,289000.0,288359.89,11748.58,7,4.24732,221.46740,0
713,294,2017-02-22,2017,2,62.75,4000,251000.0,250444.06,22941.28,43,10.08396,85.59640,0
714,172,2017-01-17,2017,1,1.82,100000,182000.0,181595.33,-7824.90,292,-4.13097,-5.16371,0

In [6]:
sells.query('buy_id == 1267')

,buy_id,date,year,month,price,qty,amt,net,profit,days,percent,yearly,dividend_id
10,1267,2023-07-04,2023,7,17.9,1800,32220.0,32148.63,1480.86,13,4.82872,135.5756,0

In [7]:
cols = 'buy_id date year month price qty amt net profit days percent yearly dividend_id'.split()
sells[cols][sells['buy_id'] == 1267]

,buy_id,date,year,month,price,qty,amt,net,profit,days,percent,yearly,dividend_id
10,1267,2023-07-04,2023,7,17.9,1800,32220.0,32148.63,1480.86,13,4.82872,135.5756,0

In [8]:
file_name = 'sells.csv'
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"
osd_file = osd_path + file_name
sells[cols].to_csv(osd_file, header=True, index=False)

In [9]:
sql = '''
SELECT * FROM buys LIMIT 1'''
buys = pd.read_sql(sql, conpf)
buys.dtypes

id            int64
stock_id      int64
date         object
qty           int64
price       float64
fee         float64
vat         float64
status       object
net         float64
kind         object
chart        object
dtype: object

In [10]:
sql = '''
SELECT id, stock_id, date, YEAR(date) AS year, MONTH(date) AS month, price, qty, 
price*qty AS amt, net, status, kind FROM buys'''
buys = pd.read_sql(sql, conpf)
buys.shape

(821, 11)

In [11]:
colb = 'id stock_id date year month price qty amt net status kind'.split()
buys[colb][buys['id'] == 1267]

,id,stock_id,date,year,month,price,qty,amt,net,status,kind
807,1267,158,2023-06-21,2023,6,17.0,1800,30600.0,30667.77,Sold,DTD

In [12]:
file_name = 'buys.csv'
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"
osd_file = osd_path + file_name
buys[colb].to_csv(osd_file, header=True, index=False)

In [13]:
sql = '''
SELECT * FROM stocks LIMIT 1'''
stocks = pd.read_sql(sql, conpf)
stocks.dtypes

id              int64
name           object
category_id     int64
website        object
dtype: object

In [14]:
sql = '''
SELECT * FROM stocks ORDER BY name'''
stocks = pd.read_sql(sql, conpf)
stocks.shape

(169, 4)

In [15]:
sql = '''
SELECT name, market AS mrkt FROM tickers'''
tickers = pd.read_sql(sql, conpg)
tickers.shape

(401, 2)

In [16]:
df = stocks.merge(tickers, on='name', how='inner')
df.dtypes

id              int64
name           object
category_id     int64
website        object
mrkt           object
dtype: object

In [17]:
	filters = [
	   (df.mrkt.str.contains('SET50')),
	   (df.mrkt.str.contains('SET100')),
	   (df.mrkt.str.contains('mai'))]
	values = ['SET50','SET100','mai']
	df["market"] = np.select(filters, values, default='SET999')

In [18]:
df.dtypes

id              int64
name           object
category_id     int64
website        object
mrkt           object
market         object
dtype: object

In [19]:
colt = 'id name market website'.split()

file_name = 'stocks.csv'
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"
osd_file = osd_path + file_name
df[colt].to_csv(osd_file, header=True, index=False)

In [20]:
df[colt].head()

    id    name  market             website
0   45  ADVANC   SET50  investor.ais.co.th
1  136  AEONTS  SET100
2  209      AH  SET999
3  182  AIMIRT  SET999
4  115   AMATA  SET100

In [21]:
sql = '''
SELECT * FROM dividends LIMIT 1'''
dividends = pd.read_sql(sql, conpf)
dividends.dtypes

id            int64
stock_id      int64
name         object
year          int64
quarter       int64
number        int64
ppu         float64
amt         float64
net         float64
x_date       object
p_date       object
dtype: object

In [22]:
sql = '''
SELECT * FROM dividends ORDER BY id DESC'''
dividends = pd.read_sql(sql, conpf)
dividends.shape

(395, 11)

In [23]:
file_name = 'dividends.csv'
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"
osd_file = osd_path + file_name
dividends.to_csv(osd_file, header=True, index=False)

### Delete from buys table en mass by stock name

In [20]:
sql = '''
SELECT * FROM buys LIMIT 1'''
buys = pd.read_sql(sql, conpf)
buys.columns

Index(['id', 'stock_id', 'date', 'qty', 'price', 'fee', 'vat', 'status', 'net',
       'kind', 'chart'],
      dtype='object')

In [3]:
sql = '''
SELECT * FROM sells LIMIT 1'''
sells = pd.read_sql(sql, conpf)
sells.columns

Index(['id', 'buy_id', 'date', 'price', 'fee', 'vat', 'net', 'days', 'profit',
       'percent', 'yearly', 'sequence', 'chart', 'dividend_id'],
      dtype='object')

In [2]:
sql = '''
SELECT * FROM stocks LIMIT 1'''
stocks = pd.read_sql(sql, conpf)
stocks.columns

Index(['id', 'name', 'category_id', 'website'], dtype='object')

In [23]:
sql = '''
SELECT * FROM stocks WHERE name = "NOBLE"'''
stocks = pd.read_sql(sql, conpf)
stocks

    id   name  category_id website
0  145  NOBLE            3

In [32]:
id = 145
sql = '''
SELECT * 
FROM buys
WHERE stock_id = %s
AND status = "Active"
AND qty < 63000
'''
sql = sql % id
df = pd.read_sql(sql, conpf)
df

,id,stock_id,date,qty,price,fee,vat,status,net,kind,chart
0,895,145,2021-05-13,6000,7.20,89.42,6.26,Active,43295.68,HD,None
1,889,145,2021-05-11,6000,8.00,99.36,6.96,Active,48106.32,HD,None
2,987,145,2021-08-13,6000,6.50,80.73,5.65,Active,39086.38,HD,None
3,1082,145,2021-12-20,21000,6.10,265.17,18.56,Active,128383.73,HD,None
4,1039,145,2021-11-03,6000,6.40,79.49,5.56,Active,38485.05,HD,None
5,1058,145,2021-11-29,6000,6.25,77.63,5.43,Active,37583.06,HD,None

In [33]:
df.qty.sum()

51000

In [34]:
sqlDel = '''
DELETE 
FROM buys
WHERE stock_id = 145
AND status = "Active"
AND qty < 63000
'''
print(sqlDel)

DELETE
FROM buys
WHERE stock_id = 145
AND status = "Active"
AND qty < 63000

In [35]:
rp = conpf.execute(sqlDel)
rp.rowcount

6